LEXICON: dict[str, str] = {
    'greeting':'<b>«Помощник юриста»</b> — Ваш надежный цифровой партнер в юридических вопросах, '
               'созданный для упрощения работы с юридическими делами, отслеживания судебных процессов '
               'и автоматизации рутинных расчетов. Он идеально подходит как для профессиональных юристов, '
               'так и для граждан, самостоятельно отстаивающих свои права.\n'
               'Введите или нажмите /help, чтобы увидеть возможности бота.\n'
               'Введите или нажмите /support, для связи с поддержкой.\n'
               'Нажмите на кнопку "Главное меню", чтобы начать работу.',
    'help': 'Ключевые возможности:\n'
            '📂 Управление делами\n'
            '— Храните всю информацию о делах в одном месте: название, суд, номер дела, статус.\n'
            '— Легко добавляйте, редактируйте или удаляйте дела через интуитивное меню.\n'
            '— Быстрый доступ к списку дел с возможностью фильтрации и поиска.\n\n'
            '⚖️ Контроль судебных заседаний\n'
            '— Получайте напоминания о ближайших заседаниях (за 2 дня и в день события).\n'
            '— Просматривайте дату, время, адрес суда и связанное дело в одном сообщении.\n'
            '— Ни одно важное слушание не останется без внимания.\n\n'
            '📅 Умный календарь\n'
            '— Все сроки подачи документов, заседаний и юридические события в едином расписании.\n'
            '— Синхронизация с Google Calendar для удобного планирования.\n'
            '— Настраиваемые уведомления, чтобы не пропустить критичные даты.\n\n'
            '🧮 Юридические калькуляторы\n'
            '— Автоматический расчет госпошлины для исковых заявлений.\n'
            '— Определение сроков исковой давности, пеней, неустоек и компенсаций.\n'
            '— Простые шаблоны для ввода данных и мгновенный результат.',
    'main_menu': 'Выберите нужную вкладку:\n\n'
            '🔍 <b>Мои дела</b> – просмотр и управление вашими делами.\n\n'
            '⚖️ <b>Судебные заседания</b> – ближайшие слушания и напоминания.\n\n'
            '📅 <b>Календарь</b> – все важные сроки и события в одном месте.\n\n'
            '🧮 <b>Юридические калькуляторы</b> – расчет госпошлины, сроков и других параметров.',
    'case': '🔍 Мои дела',
    'court_sessions': '⚖️ Судебные заседания',
    'calendar': '📅 Календарь',
    'calculators': '🧮 Юридические калькуляторы',
    'not_empty_cases': '📂 <b>Ваши дела</b>\n\n'
            '<i>Здесь вы можете управлять списком дел:</i>',
    'add_case': '➡️ Добавить новое дело',
    'back_menu': '🔙 Вернуться в меню',
    'empty_cases': '📭 Список дел пуст. Хотите добавить первое дело?',
    'edit_case': '✏️ Редактировать дело',
    'delete_case': '🗑️ Удалить дело',
    'yes_delete': '✔️ Да, удалить',
    'no_cancel': '❌ Нет, отмена',
    'menu': '⚖️ Главное меню',
    'back': 'Назад',
    'case_name': 'Редактировать название дела',
    'court': 'Редактировать название суда',
    'court_case_name': 'Редактировать номер дела',
    'enter_case_name': 'Введите название дела',
    'enter_court_case_name': 'Введите номер дела в суде',
    'enter_court_name': 'Введите название суда'
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': 'Начальная страница',
    '/help': 'Помощь'
}